c({"name": "contacts.designing", "type": "page", "comment": "<p>Widgets should be dumb to whats going on around them. They should be self contained and provide an easy to use API for developers.  The first step in designing a widget is to define the input and outputs.</p>\n\n<h2>Defining Inputs and Outputs</h2>\n\n<p>Inputs are anything a widget consumes from the outside world.  This can include parameters passed (optional or required) or DOM events expected.  For example, a grid widget consumes parameters like page offset, initial sort, and column names.</p>\n\n<p>Outputs are anything a widget visibly produces for the outside world.  This can include DOM created, events triggered, callback functions executed, data changed, etc.  For example, a grid widget might produce \"pageChanged\" or \"columnSorted\" events.</p>\n\n<p>Let's examine the inputs and outputs of the <em>MXUI.Data.Grid</em> widget.</p>\n\n<p><img class='image_tag' src='tutorials/images/inputs_outputs.jpg' /></p>\n\n<h2>Anatomy of the List Module</h2>\n\n<p>One of the reusable modules in the Contacts app is List. The List is a simple widget that takes a model, gets and lists data, and listens for updates to the items to update and/or destroy rows.</p>\n\n<pre><code>$(\"#category .list_wrapper\").mxui_data_list({\n    model : Contacts.Models.Category,\n    show : \"//contacts/views/categoryList\",\n    create: \"//contacts/views/categoryCreate\"\n})\n</code></pre>\n\n<p>In this app, the category, location, and company sections are all filters for the contacts grid. Upon clicking one of these rows, the grid is filtered with the selection. These lists are all managed using <em>MXUI.Data.List</em>.  We'll walk through how this widget works to illustrate creating reusable, self contained modules.</p>\n\n<h3>Getting the List Data</h3>\n\n<p>When initialized, you pass the List a [jQuery.model model] class.  JavaScriptMVC models have a standard API to perform CRUD operations.  Every model implements a [jQuery.Model.static.findAll findAll] method, which we can leverage to fetch data.</p>\n\n<pre><code>this.options.model.findAll(this.options.params, this.callback('list'))\n</code></pre>\n\n<p>If you look at the models in <em>contacts/models</em>, you'll notice findAll is missing. By default, models will request data using REST standards, as described in [jquery.model.encapsulate Service Encapsulation]. Every model has a findAll method, implemented in the based [jquery.model jQuery.Model] class.</p>\n\n<h3>Drawing the List</h3>\n\n<p>One of List's parameters is a 'list' template.  After the model has completed its <em>findAll</em>, we will take its results and draw the UI.</p>\n\n<pre><code>this.element.html(this.options.list,{\n    items : this.options.sort ? items.sort(this.options.sort) : items,\n    options: this.options\n});\n</code></pre>\n\n<h3>Capturing Updates</h3>\n\n<p>In a live application, data changes.  The List should be aware of these changes and update its UI accordingly.  List listens for updates for its given model and refreshes UI with the latest data.</p>\n\n<pre><code>\"{model} updated\" : function(model, ev, item){\n    var el = item.elements(this.element).html(this.options.show, item);\n    if(this.options.updated){\n        this.options.updated(this.element, el, item)\n    }\n},\n</code></pre>\n\n<p>In the [contacts.glue Gluing Modules Together] section, we will discuss using this type of observer architecture.</p>\n\n<h3>Responding to Clicks</h3>\n\n<p>As items are clicked in the list, a \"selected\" visual state is applied to the item.</p>\n\n<pre><code>\".item {activateEvent}\" : function(el, ev){\n    if(el.hasClass(\"activated\")){\n        this._deactivate(el)\n    } else {\n        var old = this.find(\".activated\");\n        this._deactivate(old);\n        this._activate(el);\n    }\n},\n_deactivate: function(el){\n    el.removeClass(\"activated\");\n    el.trigger(\"deactivate\", el.model());\n},\n_activate: function(el){\n    el.addClass(\"activated\");\n    el.trigger(\"activate\", el.model());\n}\n</code></pre>\n\n<p>In the above code, we  trigger an <em>activate</em> event.  This event is one of List's outputs that we listen to using [jquery.controller.listening event delegation].  As opposed to applications listening for \"click\" events, we use activate to provide a level of abstraction.  This allows the widget to provide other ways to activate a row, such as keyboard navigation or clicking.  We could even expand this widget to use touch events for mobile devices, and applications wouldn't have to change.  For more information on this you can read the [mvc.controller Controller] documentation. </p>\n\n<p>The mission of this widget was simple: create a list of data that updates itself as the items change.  You and I have probably written this a dozen times in our applications.  This List widget provides a reusable API because it has generic and well defined inputs and outputs.</p>\n\n<p>Next up, we will discuss how to [contacts.glue glue] our isolated modules into a full application.</p>", "title": "Designing Modules", "parents": ["contacts"], "order": 1, "src": "tutorials/examples/contacts/designing.md", "children": []})