c({"name": "contacts.dc", "type": "page", "comment": "<p>The secret to building large applications is never build large applications.  Understanding how to divide your application is the first step towards maintainable architecture.  This section covers why and how to divide up your app and uses contacts as an example.</p>\n\n<h2>Isolation</h2>\n\n<p>The goal for dividing your application should be to create modules that are isolated.</p>\n\n<p>Isolated modules are dumb, lonely, and replaceable.  Dumb because they are limited to one specific purpose, for example showing a list of data.  Lonely because they rarely reference other modules.  Replaceable because they have a simple API, making them easy to swap out.</p>\n\n<p>Isolated modules are easily testable because they have a small, well defined scope.  Each piece can be worked on in parallel because the code is divided.  Reuse is easier because the modules are not coupled to each other.</p>\n\n<h2>Dividing Contacts</h2>\n\n<p>The contacts app has 3 lists that filter the grid of contacts.  You can create additional categories and contacts by clicking the 'new' icon.</p>\n\n<p>The application can be divided up into a few widgets:</p>\n\n<ul>\n<li>List - accepts a generic data source and layout, renders and updates the list.</li>\n<li>Grid - accepts a generic data source, renders a grid.</li>\n<li>Sort - sorts the grid items.</li>\n<li>Create - renders a form to create a new instance from a data source.</li>\n</ul>\n\n<p>Heres a visual representation of how this app is broken up into modules.</p>\n\n<p><img class='image_tag' src='tutorials/images/contacts_widgets.jpg' /></p>\n\n<h2>Folder Structure</h2>\n\n<p>The code for these widgets is divided into three top level folders: MXUI, Jupiter, and Contacts.</p>\n\n<h3>MXUI</h3>\n\n<p>[https://github.com/jupiterjs/mxui MXUI]  (jQueryMX User Interface) is a JavaScriptMVC widget library. The Grid and List widgets from MXUI are used in Contacts.</p>\n\n<h3>Jupiter</h3>\n\n<p>Each isolated module lives in its own directory.  Those directories are then grouped in a namespace, for example <em>Jupiter</em> or the name of your company.  These modules are intended to be reused across applications.</p>\n\n<p>The Jupiter folder contains:</p>\n\n<ul>\n<li>create - renders a form to create a new instance from a data source.</li>\n<li>style - attaches jQuery UI styles to elements.</li>\n<li>scrollable_grid - creates a infinitely scrollable grid using the MXUI grid.  </li>\n</ul>\n\n<h3>Contacts</h3>\n\n<p>Finally, we need a widget that loads the modules and ties them together into a application.  In this application, the contacts folder contains this 'application widget'.</p>\n\n<p>This widget will be where the application starts, loading each module, initializing them, and gluing them together.</p>\n\n<pre><code>$.Controller(\"Contacts.Controller\", {\n    init: function(){\n\n        this.params = new Mxui.Data();\n\n        $(\"#category .list_wrapper\").mxui_data_list({\n            model : Contacts.Models.Category,\n            show : \"//contacts/views/categoryList\",\n            create: \"//contacts/views/categoryCreate\"\n        });\n\n        $(\"#location .list_wrapper\").mxui_data_list({\n            model : Contacts.Models.Location,\n            show : \"//contacts/views/categoryList\",\n            create: \"//contacts/views/categoryCreate\"\n        });\n</code></pre>\n\n<p>The contacts widget listens for events using event delegation and communicates with cousin widgets.</p>\n\n<pre><code>\"#category .list_wrapper activate\": function(el, ev, item){\n    this.params.attr(\"categoryId\", item.id);\n}, \n\"#category .list_wrapper deactivate\": function(el, ev, item){\n    this.params.attr(\"categoryId\", null);\n}\n</code></pre>\n\n<p>In the [contacts.glue Gluing Modules Together] section, we will touch more on the pattern used to facilitate this cross-widget communication.</p>\n\n<p>Additionally in the contacts folder, you will find the building blocks of any JavascriptMVC application: models for communication with the server, fixtures for simulating AJAX responses from the server, and functional tests for testing the application.</p>\n\n<p>In the next section, we will get into more detail about [contacts.designing how to design each module].</p>", "title": "Divide and Conquer", "parents": ["contacts"], "order": 0, "src": "tutorials/examples/contacts/dc.md", "children": []})