c({"name": "funcunit.features", "type": "page", "comment": "<h2>Why FuncUnit</h2>\n\n<p>TESTING IS PAINFUL.  Everyone hates testing, and most front end developers simply don't test.  There \nare a few reasons for this:</p>\n\n<ol>\n<li><strong>Barriers to entry</strong> - Difficult setup, installation, high cost, or difficult APIs.  QTP costs $5K per license.</li>\n<li><strong>Completely foreign APIs</strong> - Testing frameworks often use other languages (Ruby, C#, Java) and new APIs.</li>\n<li><strong>Debugging across platforms</strong> - You can't use firebug to debug a test that's driven by PHP.</li>\n<li><strong>Low fidelity event simulation</strong> - Tests are often brittle or low fidelity because frameworks aren't designed to test heavy JavaScript apps, so \nbrowser event simualation accuracy isn't a top priority.</li>\n<li><strong>QA and developers can't communicate</strong> - If only QA has the ability to run tests, sending bug reports is messy and time consuming.</li>\n</ol>\n\n<p>FuncUnit aims to fix these problems:</p>\n\n<ol>\n<li>FuncUnit is free and has no setup or installation (just requires Java and a browser). </li>\n<li>FuncUnit devs know jQuery, and FuncUnit leverages that knowldge with a jQuery-like API.</li>\n<li>You can run tests in browser and set Firebug breakpoints.</li>\n<li>Syn.js is a low level event simuation library that goes to extra trouble to make sure each browser simulates events exactly as intended.</li>\n<li>Since tests are just JS and HTML, they can be checked into a project and any dev can run them easily.  QA just needs to send a URL to a broken \ntest case.</li>\n</ol>\n\n<p>There are many testing frameworks out there, but nothing comes close to being a complete solution for front end testing like FuncUnit does.</p>\n\n<h2>Changes from 3.1</h2>\n\n<p>FuncUnit has undergone some big changes from JavaScriptMVC 3.1.</p>\n\n<h3>Commandline revamp</h3>\n\n<p>The method of running from commandline is now more consistent. You configure reporting and settings the same \nway in settings.js.  Env, Phantom, and Selenium work in the same way.</p>\n\n<h3>Steal.browsers</h3>\n\n<p>The new steal.browser API is a layer that abstracts opening a browser using a browser automation tool and \nmakes it easy to add new ones.  PhantomJS was a new browser added with this API. Steal.browser can be used in \nother parts of JavaScriptMVC, like steal/html.</p>\n\n<h3>No more separate browser drivers</h3>\n\n<p>There used to be separate browser drivers for running in browser and selenium. Now there is only one way of \nusing the FuncUnit API, which brings consistency no matter the environments.</p>\n\n<p>The driver system created difficult to debug issues when running from Selenium, which would not occur in \nbrowser mode. Without drivers, tests run more consistently.</p>\n\n<p>Also, implementing features in both drivers was difficult and required a complex build step. Adding \nto the FuncUnit API is now simpler and faster.</p>\n\n<h3>CI integration</h3>\n\n<p>Integration with Jenkins and Maven are part of the 3.2 changes. Using the XUnit plugin and passing error \ncodes, you can more easily build FuncUnit into your build and CI system.</p>\n\n<p>Its also possible to easily customize FuncUnit output by making your own reporting functionality. All you have \nto do is add your own FuncUnit event handlers.</p>\n\n<h3>Passing around collections</h3>\n\n<p>FuncUnit's internals are reworked so that S is now a subbed version of jQuery.  S calls $ with the context \nset to your app window. \"this\" always points to current collection, whereas before it wasn't possible to access \nthe actual collection, just the selector.</p>\n\n<p>This has several advantages. Its easier to add plugins to S.  Its also easier to get information about \nthe elements, using any jQuery.fn method.  Debugging is easier, because there is more visibility while \nexecuting asynchronous callbacks.  You can inspect at various points and see why the test is failing</p>\n\n<h3>No breaking changes</h3>\n\n<p>We were very careful while making these changes to not break the API.  Any existing tests will still \nwork, but will be less brittle when using Selenium and other automation tools.</p>\n\n<p>** There is actually one minor difference, which most users won't ever notice. It used to be that you could \n\"cache\" S objects and reuse them within callbacks.  The query they represented would be re-run.  In 3.2+ FuncUnit, \nthis is no longer the case.  Since S objects are just jQuery collections, synchronous queries need to be rerun by \ncalling S again.</p>\n\n<h3>Updated to latest QUnit</h3>\n\n<p>The latest version of QUnit has a few nice features and an updated UI.</p>\n\n<h3>PhantomJS</h3>\n\n<p>PhantomJS support now makes it more feasible to run FuncUnit tests as part of a build process.</p>\n\n<h2>Roadmap</h2>\n\n<p>The next FuncUnit features we plan to work on include. Let us know if you want these features or want to help!</p>\n\n<ul>\n<li>[http://siliconforks.com/jscoverage/ JSCoverage] integration for test coverage stats</li>\n<li>[http://code.google.com/p/js-test-driver/ JSTestDriver] integration</li>\n</ul>\n\n<h2>Comparison to other frameworks</h2>\n\n<h3>Functional vs unit</h3>\n\n<h3>Automated vs browser based</h3>\n\n<h3>Accurate event simulation</h3>", "title": "Features", "parents": ["FuncUnit"], "order": 9, "src": "funcunit/pages/features.md", "children": []})