c({"name": "funcunit.coverage", "type": "page", "comment": "<p>This guide will show you how to determine the code coverage of your FuncUnit tests.  Code \ncoverage is tracked and calculated by [steal.instrument].</p>\n\n<h2>Basic reporting</h2>\n\n<p>To turn on code coverage for any funcunit or qunit test, open the page with URL param steal[instrument]=true. <br />\nFor example, to run the FuncUnit test suite with instrumentation turned on, open \n[http://javascriptmvc.com/funcunit/funcunit.html?steal[instrument]=true].</p>\n\n<p>After the test completes, a coverage report will be shown:</p>\n\n<p><img class='image_tag' src='jmvc/images/coverage_report.png' /></p>\n\n<p>steal[instrument]=true tells steal.instrument not to ignore any files.  Passing !jmvc will cause all JMVC and test \ndirectories to be ignored (which is the behavior you want for testing an application).</p>\n\n<p>To see which blocks of a file are covered and which are not, click a file's name:</p>\n\n<p><img class='image_tag' src='jmvc/images/coverage_file.png' /></p>\n\n<p>The numbers on the left are how many times each line has been run.</p>\n\n<h2>Running from commandline</h2>\n\n<p>To turn on coverage from the commandline, use the -coverage flag, like:</p>\n\n<p>./js funcunit/run selenium http://javascriptmvc.com/funcunit/funcunit.html -coverage</p>\n\n<p>A report will appear on the console after the test completes:</p>\n\n<p><img class='image_tag' src='jmvc/images/coverage_commandline.png' /></p>\n\n<p>The results are saved in a JSON file.  To view the report later, open funcunit/coverage/coverage.html.</p>\n\n<h2>Ignoring files</h2>\n\n<p>When you're determining code coverage, you won't want to include non application code in your coverage statistics.  JMVC and other \nthird party code will skew coverage statistics.</p>\n\n<p>To ignore files when running from commandline, open funcunit/settings.js and edit the coverageIgnore property.  Any string in this \narray will be matched against files.  Matches will be ignored.  * is used as an asterisk.  *<em>_test.js will ignore any file ending in \n_</em>test.js.</p>\n\n<p>Running in browser, you can add files to ignore via a list of patterns instrument URL param, like:</p>\n\n<p>[http://javascriptmvc.com/funcunit/funcunit.html?steal[instrument]=jquery,*_test.js] </p>\n\n<h2>Cobertura-Jenkins integration</h2>\n\n<p>Coming soon</p>", "title": "Code Coverage", "parents": ["FuncUnit"], "order": 6, "src": "funcunit/pages/coverage.md", "children": []})