c({"name": "jQuery.event.resize", "type": "page", "comment": "<p><code>jQuery.event.resize</code> allows you to listen to <code>resize</code> events on arbitrary elements.\nUnlike other events that bubble from the target element to the document the <code>resize</code> event will propagate from the outside-in.\nThis means that outside elements will always resize first.\nTrigger the <code>resize</code> event whenever the dimensions of an element change and inside elements should adjust as well.</p>\n\n<p>By listening to a resize event, you will be alerted whenever a parent element has a <code>resize</code> event triggered on it. For example:</p>\n\n<pre><code>$('#foo').bind('resize', function(){\n  // adjust #foo's dimensions\n})\n\n$(document.body).trigger(\"resize\");\n</code></pre>\n\n<h2>The 'Right Order'</h2>\n\n<p>When a control changes size, typically, you want only internal controls to have to adjust their\ndimensions.  Furthermore, you want to adjust controls from the 'outside-in', meaning\nthat the outermost control adjusts its dimensions before child controls adjust theirs.</p>\n\n<p><code>jQuery.event.resize</code> calls <code>resize</code> events in exactly this manner.</p>\n\n<p>When you trigger a <code>resize</code> event, it will propagate up the DOM until it reaches\nan element with the first resize event\nhandler.  There it will move the event in the opposite direction, calling the element's\nchildren's resize event handlers.</p>\n\n<p>If your intent is to call <code>resize</code> without bubbling and only trigger child element's handlers,\nuse the following:</p>\n\n<pre><code>$(\"#foo\").trigger(\"resize\", false);\n</code></pre>\n\n<h2>Stopping Children Updates</h2>\n\n<p>If your element doesn't need to change it's dimensions as a result of the parent element, it should\ncall <code>event.stopPropagation()</code>.  This will stop <code>resize</code> from being sent to child elements of the current element.</p>\n\n<h2>Demo</h2>\n\n<p>The <code>resize</code> event is very helpful for creating application like layouts. The following example uses [jQuery.dimensions] and the <code>resize</code> event to implement a common layout. Just drag the blue square to resize the container. Note the yellow top navigation. Even when the text wraps the sizes will still adjust properly. This is not possible using only CSS:</p>\n\n<iframe style=\"width: 100%; height: 350px\" src=\"http://jsfiddle.net/TcB5y/embedded/result,html,js,css\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\">JSFiddle</iframe>", "parents": ["jquerypp"], "src": "jquery/event/resize/resize.md", "children": []})