c({"name": "mvc.controller", "type": "page", "comment": "<p>JavaScriptMVC's controllers are many things.  They are a jQuery plugin factory.  They can be used as a traditional view, making pagination widgets and grid controls.  Or, they can be used as a traditional controller, initializing and controllers and hooking them up to models.  Mostly, controller's are a really great way of organizing your application's code.</p>\n\n<p>Controllers provide a number of handy features such as:</p>\n\n<ul>\n<li>jQuery plugin creation</li>\n<li>automatic binding</li>\n<li>default options</li>\n<li>automatic determinism</li>\n</ul>\n\n<p>But controller's most important feature is not obvious to any but the most hard-core JS ninjas.  The following code creates a tooltip like widget that displays itself until the document is clicked.</p>\n\n<pre><code>$.fn.tooltip = function(){\n  var el = this[0];\n\n  $(document).click(function(ev){\n    if(ev.target !== el){\n      $(el).remove()\n    }\n  })\n\n  $(el).show();\n  return this;\n})\n</code></pre>\n\n<p>To use it, you'd add the element to be displayed to the page, and then call tooltip on it like:</p>\n\n<pre><code>$(\"&lt;div class='tooltip'&gt;Some Info&lt;/div&gt;\")\n    .appendTo(document.body)\n    .tooltip()\n</code></pre>\n\n<p>But, this code has a problem.  Can you spot it?  Here's a hint. What if your application is long lived and lots of these tooltip elements are created?  </p>\n\n<p>The problem is this code leaks memory!  Every tooltip element, and any tooltip child elements, are kept in memory forever.  This is because the click handler is not removed from the document and has a closure reference to the element.  </p>\n\n<p>This is a frighteningly easy mistake to make.  jQuery removes all event handlers from elements that are removed from the page so developers often don't have to worry about unbinding event handlers.  But in this case, we bound to something outside the widget's element, the document, and did not unbind the event handler.</p>\n\n<p>But within a Model-View-Controller architecture, Controllers listen to the View and Views listen to the Model.  You are constantly listening to events outside the widget's element.  For example, the <code>nextPrev</code> widget from the <code>$.Model</code> section listens to updates in the paginate model:</p>\n\n<pre><code>paginate.bind('updated.attr', function(){\n  self.find('.prev')[this.canPrev() ? 'addClass' : 'removeClass']('enabled')\n  self.find('.next')[this.canNext() ? 'addClass' : 'removeClass']('enabled');\n})\n</code></pre>\n\n<p>But, it doesn't unbind from paginate!  Forgetting to remove event handlers is potentially a source of errors.  However, both the tooltip and nextPrev would not error.  Instead both will silently kill an application's performance.  Fortunately, $.Controller makes this <strong>easy</strong> and <strong>organized</strong>.  We can write tooltip like:</p>\n\n<pre><code>$.Controller('Tooltip',{\n  init: function(){\n    this.element.show()\n  },\n  \"{document} click\": function(el, ev){\n    if(ev.target !== this.element[0]){\n      this.element.remove()\n    }\n  }\n})\n</code></pre>\n\n<p>When the document is clicked and the element is removed from the DOM, $.Controller will automatically unbind the document click handler.  </p>\n\n<p>$.Controller can do the same thing for the nextPrev widget binding to the the paginate model:</p>\n\n<pre><code>$.Controller('Nextprev',{\n  \".next click\" : function(){\n    var paginate = this.options.paginate;\n    paginate.attr('offset', paginate.offset+paginate.limit);\n  },\n  \".prev click\" : function(){\n    var paginate = this.options.paginate;\n    paginate.attr('offset', paginate.offset-paginate.limit );\n  },\n  \"{paginate} updated.attr\" : function(ev, paginate){\n    this.find('.prev')[paginate.canPrev() ? 'addClass' : 'removeClass']('enabled')\n    this.find('.next')[paginate.canNext() ? 'addClass' : 'removeClass']('enabled');\n  }\n})\n\n// create a nextprev control\n$('#pagebuttons').nextprev({ paginate: new Paginate() })\n</code></pre>\n\n<p>If the element <code>#pagebuttons</code> is removed from the page, the Nextprev controller instance will automatically unbind from the paginate model. </p>\n\n<p>Now that your appetite for error free code is properly whetted, the following details how $.Controller works.</p>\n\n<h3>Overview</h3>\n\n<p>$.Controller inherits from $.Class.  To create a Controller class, call <code>$.Controller( NAME, classProperties, instanceProperties )</code> with the name of your controller, static methods, and instance methods.  The following is the start of a reusable list widget:</p>\n\n<pre><code>$.Controller(\"List\", {\n  defaults : {}\n},{\n  init : function(){  },\n  \"li click\" : function(){  }\n})\n</code></pre>\n\n<p>When a controller class is created, it creates a jQuery helper method of a similar name.  The helper method is primarily use to create new instances of controller on elements in the page.  The helper method name is the controller's name underscored, with any periods replaced with underscores.  For example, the helper for <code>$.Controller('App.FooBar')</code> is <code>$(el).app<em>foo</em>bar()</code>.</p>\n\n<h3>Controller Instantiation</h3>\n\n<p>To create a controller instance, you can call <code>new Controller(element, options)</code> with a HTMLElment or jQuery-wrapped element and an optional options object to configure the controller.  For example:</p>\n\n<pre><code>new List($('ul#tasks'), {model : Task});\n</code></pre>\n\n<p>You can also use the jQuery helper method to create a List controller instance on the <code>#tasks</code> element like:</p>\n\n<pre><code>$('ul#tasks').list({model : Task})\n</code></pre>\n\n<p>When a controller is created, it calls the controller's prototype init method with:</p>\n\n<ul>\n<li><code>this.element</code> set to the jQuery-wrapped HTML element </li>\n<li><code>this.options</code> set to the options passed to the controller merged with the class's <code>defaults</code> object. </li>\n</ul>\n\n<p>The following updates the List controller to request tasks from the model and render them with an optional template passed to the list:</p>\n\n<pre><code>$.Controller(\"List\", {\n  defaults : {\n    template: \"items.ejs\"\n  }\n},{\n  init : function(){\n    this.element.html( this.options.template, this.options.model.findAll() ); \n  },\n  \"li click\" : function(){  }\n})\n</code></pre>\n\n<p>We can now configure Lists to render tasks with a template we provide.  How flexible!</p>\n\n<pre><code>$('#tasks').list({model: Task, template: \"tasks.ejs\"});\n$('#users').list({model: User, template: \"users.ejs\"})\n</code></pre>\n\n<p>If we don't provide a template, List will default to using items.ejs.</p>\n\n<h3>Event Binding</h3>\n\n<p>As mentioned in $.Controller's introduction, it's most powerful feature is it's ability to bind and unbind event handlers.  </p>\n\n<p>When a controller is created, it looks for action methods.  Action methods are methods that look like event handlers.  For example, <code>\"li click\"</code>.  These actions are bound using <code>jQuery.bind</code> or <code>jQuery.delegate</code>.  When the controller is destroyed, by removing the controller's element from the page or calling destroy on the controller, these events are unbound, preventing memory leaks.</p>\n\n<p>The following are examples of actions with descriptions of what the listen for:</p>\n\n<ul>\n<li><code>\"li click\"</code> - clicks on or within <code>li</code> elements within the controller element.</li>\n<li><code>\"mousemove\"</code> - mousemoves within the controller element.</li>\n<li><code>\"{window} click\"</code> - clicks on or within the window.</li>\n</ul>\n\n<p>Action functions get called back with the jQuery-wrapped element or object that the event happened on and the event.  For example:</p>\n\n<pre><code>\"li click\": function( el, ev ) {\n  assertEqual(el[0].nodeName, \"li\" )\n  assertEqual(ev.type, \"click\")\n}\n</code></pre>\n\n<h3>Templated Actions</h3>\n\n<p>$.Controller supports templated actions.  Templated actions can be used to bind to other objects, customize the event type, or customize the selector.</p>\n\n<p>Controller replaces the parts of your actions that look like <code>{OPTION}</code> with a value in the controller's options or the window. </p>\n\n<p>The following is a skeleton of a menu that lets you customize the menu to show sub-menus on different events:</p>\n\n<pre><code>$.Controller(\"Menu\",{\n  \"li {openEvent}\" : function(){\n    // show subchildren\n  }\n});\n\n//create a menu that shows children on click\n$(\"#clickMenu\").menu({openEvent: 'click'});\n\n//create a menu that shows children on mouseenter\n$(\"#hoverMenu\").menu({openEvent: 'mouseenter'});\n</code></pre>\n\n<p>We could enhance the menu further to allow customization of the menu element tag:</p>\n\n<pre><code>$.Controller(\"Menu\",{\n  defaults : {menuTag : \"li\"}\n},{\n  \"{menuTag} {openEvent}\" : function(){\n    // show subchildren\n  }\n});\n\n$(\"#divMenu\").menu({menuTag : \"div\"})\n</code></pre>\n\n<p>Templated actions let you bind to elements or objects outside the controller's element.  For example, the Task model from the $.Model section produces a \"created\" event when a new Task is created.  We can make our list widget listen to tasks being created and automatically add these tasks to the list like:</p>\n\n<pre><code>$.Controller(\"List\", {\n  defaults : {\n    template: \"items.ejs\"\n  }\n},{\n  init : function(){\n    this.element.html( this.options.template, this.options.model.findAll() ); \n  },\n  \"{Task} created\" : function(Task, ev, newTask){\n    this.element.append(this.options.template, [newTask])\n  }\n})\n</code></pre>\n\n<p>The <code>\"{Task} create\"</code> gets called with the Task model, the created event, and the newly created Task. The function uses the template to render a list of tasks (in this case there is only one) and add the resulting html to the element.</p>\n\n<p>But, it's much better to make List work with any model.  Instead of hard coding tasks, we'll make controller take a model as an option:</p>\n\n<pre><code>$.Controller(\"List\", {\n  defaults : {\n    template: \"items.ejs\",\n    model: null\n  }\n},{\n  init : function(){\n    this.element.html( this.options.template, this.options.model.findAll() ); \n  },\n  \"{model} created\" : function(Model, ev, newItem){\n    this.element.append(this.options.template, [newItem])\n  }\n});\n\n// create a list of tasks\n$('#tasks').list({model: Task, template: \"tasks.ejs\"});\n</code></pre>\n\n<h2>Putting it all together - an abstract CRUD list.</h2>\n\n<p>Now we will enhance the list to not only add items when they are created, but update them and remove them when they are destroyed.  To do this, we start by listening to updated and destroyed:</p>\n\n<pre><code>\"{model} updated\" : function(Model, ev, updatedItem){\n  // find and update the LI for updatedItem\n},\n\"{model} destroyed\" : function(Model, ev, destroyedItem){\n  // find and remove the LI for destroyedItem\n}\n</code></pre>\n\n<p>You'll notice here we have a problem.  Somehow, we need to find the element that represents particular model instance.  To do this, we need to label the element as belonging to the model instance.  Fortunately, $.Model and $.View make labeling an element with an instance and finding that element very easy.  </p>\n\n<p>To label the element with a model instance within an EJS view, you simply write the model instance to the element.  The following might be <code>tasks.ejs</code></p>\n\n<pre><code>&lt;% for(var i =0 ; i &lt; this.length; i++){ %&gt;\n  &lt;% var task = this[i]; %&gt;\n  &lt;li &lt;%= task %&gt; &gt; &lt;%= task.name %&gt; &lt;/li&gt;\n&lt;% } %&gt;\n</code></pre>\n\n<p><code>tasks.ejs</code> iterates through a list of tasks.  For each task, it creates an <code>li</code> element with the task's name.  But, it also adds the task to the element's jQuery data with: <code>&lt;li &lt;%= task %&gt; &gt;</code>.</p>\n\n<p>To later get that element given a model instance, you can call <code>modelInstance.elements([CONTEXT])</code>.  This returns the jQuery-wrapped elements the represent the model instance.  </p>\n\n<p>Putting it together, list becomes:</p>\n\n<pre><code>$.Controller(\"List\", {\n  defaults : {\n    template: \"items.ejs\",\n    model: null\n  }\n},{\n  init : function(){\n    this.element.html( this.options.template, this.options.model.findAll() ); \n  },\n  \"{model} created\" : function(Model, ev, newItem){\n    this.element.append(this.options.template, [newItem])\n  },\n  \"{model} updated\" : function(Model, ev, updatedItem){\n    updatedItem.elements(this.element)\n      .replaceWith(this.options.template, [updatedItem])\n  },\n  \"{model} destroyed\" : function(Model, ev, destroyedItem){\n    destroyedItem.elements(this.element)\n      .remove()\n  }\n});\n\n// create a list of tasks\n$('#tasks').list({model: Task, template: \"tasks.ejs\"});\n</code></pre>\n\n<p>It's almost frighteningly easy to create abstract, reusable, memory safe widgets with JavaScriptMVC.</p>\n\n<p>Boo!</p>", "title": "Controller", "parents": ["mvc"], "order": 3, "src": "tutorials/mvc/mvc.controller.md", "children": []})