c({"name": "resize", "type": "page", "comment": "<h1>can.ui.Resize</h1>\n\n<p>can.ui comes with a simple resizable widget. It is a widget that allows you to resize elements with draggable handles. The base can.ui.Resize widget allows you to customize the resizing experience by:</p>\n\n<ol>\n<li>Restricting the size of the element by setting minimum and maximum heights and widths</li>\n<li>Customizing the aspect ratio of the element, so when resizing the element's height and width will remain in proportion with the other.</li>\n<li>Postponing resizing of the element either for a set amount of time, or until the mouse has moved a certain amount of pixels away from the element</li>\n</ol>\n\n<p>can.ui.Resize also lets you hook these events while resizing elements:</p>\n\n<ul>\n<li>resizestart</li>\n<li>resize</li>\n<li>resizestop</li>\n</ul>\n\n<h3>resizestart</h3>\n\n<p>This event is triggered at the start of resizing an element. This happens as soon as you mouse down on one of the resize handles.</p>\n\n<h3>resize</h3>\n\n<p>This event is triggered every time the mouse moves while dragging a resize handle.</p>\n\n<h3>resizestop</h3>\n\n<p>This event is triggered at the end of resizing an element, as soon as you mouse up on one of the resize handles.</p>\n\n<h2>Example - Resizable Modal</h2>\n\n<p><a href=\"http://jqueryui.com/demos/dialog/\">jQuery UI's Dialog</a> allows you to resize modal dialogs by default with the resizable flag. We can recreate this behavior in a custom widget with the can.ui.Resize and can.ui.Modal widgets together. Basically what we need to do is:</p>\n\n<ol>\n<li>Create a modal widget</li>\n<li>When the widget is created, make the element resizable</li>\n</ol>\n\n<p>We can implement a widget with this functionality by overriding the modal's init event, and applying the resize widget to its element as such:</p>\n\n<pre><code>var resizableModal = can.ui.Modal({}, {\n    init: function() {\n    this._super.apply(this, arguments);\n    new can.ui.Resize(this.element);\n  }\n})\n</code></pre>\n\n<p>This allows us to to create several resizable modals by calling:</p>\n\n<pre><code>var modal = new resizableModal(element);\n</code></pre>\n\n<h2>Example - Destroy Resize After Displaying Full Content</h2>\n\n<p>You might want to allow a certain portion of your content to remain hidden from view until it's dragged into view. Once the content is completely in view, you wouldn't want the user to hide it again. We can do this by listening for  the resize and resizestop events. We can implement it as:</p>\n\n<p>This is the HTML structure for the content:</p>\n\n<pre><code>&lt;div id=\"disable-content\"&gt;\n    &lt;div class=\"temp_content\" style=\"display: none; width:300px\"&gt;&lt;/div&gt;\n    &lt;div id=\"resizable\" style=\"width:300px\"&gt;\n    Nam metus purus, convallis eu mollis lacinia, consequat eu erat. Cras ac velit sit amet dolor luctus pulvinar vel lobortis metus. Donec vehicula varius blandit. Aenean ultrices lacinia mi adipiscing pulvinar. Etiam tincidunt, magna quis pretium mattis, arcu augue varius leo, ut aliquam ligula diam sed lorem. Phasellus faucibus, nulla in aliquet tempus, quam lectus fermentum turpis, fringilla aliquet nibh ante a leo.\n    &lt;/div&gt;\n    &lt;div class=\"status\"&gt;Drag to show more content&lt;/div&gt;\n&lt;/div&gt;\n</code></pre>\n\n<p>Our resizable widget is implemented like this:</p>\n\n<pre><code>var disableAfterResize = can.ui.Resize({ }, {\n  init: function(el, ev) {\n    this.options.handles = ['s'];\n    this._super.apply(this, arguments);\n    this.max_height = this.element.siblings('.temp_content').html(this.element.html()).height();\n\n  },\n  \" resize\": function(el, ev) {\n    if(el.height() &gt;= this.max_height) {\n      this.element.siblings('.status').html('No more content');\n    }\n    else {\n        this.element.siblings('.status').html('Drag to show more content');\n    }\n  },\n  \" resizestop\": function(el, ev) {\n    if(el.height() &gt;= this.max_height) {\n      this.destroy();\n    }\n  }\n})\n</code></pre>\n\n<p>When we drag down the widget, we now add extra functionality whenever it is resized and when resizing stops. If the height of the widget is greater than or equal to the height of the content, we say that all the content is shown. Once resizing is stopped, if this is still the case, we remove the ability to resize.</p>", "src": "canui/resize/resize.md", "children": []})